In [1]:
import sqlite3

In [2]:
# connecting with the database
db = sqlite3.connect("my_database1.db")
# drop table if it already exist using execute() method
db.execute("drop table if exists grades1")
# create table as per requirement
db.execute("create table grades1(id int, name text, score int)")
# inserting values inside the created table 
db.execute("insert into grades1(id,name,score) values(101, 'John',99)")
db.execute("insert into grades1(id,name,score) values(102, 'Gary',90)")
db.execute("insert into grades1(id,name,score) values(103, 'James',80)")
db.execute("insert into grades1(id,name,score) values(104, 'Cathy',85)")
db.execute("insert into grades1(id,name,score) values(105, 'Kris',95)")

In [4]:
db.commit() #db.commit() commits (saves) all the changes made during the current transaction.

In [5]:
results = db.execute("select * from grades1 order by id")# This query will return all rows from the grades1 table, but sorted by the id column in ascending order.
for row in results:
    print(row)
print("-" * 60)

(101, 'John', 99)
(102, 'Gary', 90)
(103, 'James', 80)
(104, 'Cathy', 85)
(105, 'Kris', 95)
------------------------------------------------------------

In [6]:
results = db.execute("select * from grades1 where name='Gary' ") #This query retrieves all rows (*) from the grades1 table where the name column is equal to 'Gary'.
for row in results:
    print(row)
print("-" * 60)

(102, 'Gary', 90)
------------------------------------------------------------

In [7]:
results = db.execute("select * from grades1 where score >= 90 ") #This query retrieves all rows (*) from the grades1 table where the value in the score column is greater than or equal to 90.
for row in results:
    print(row)
print("-" * 60)

(101, 'John', 99)
(102, 'Gary', 90)
(105, 'Kris', 95)
------------------------------------------------------------

In [8]:
results = db.execute("select name, score from grades1 order by score desc ")  #This query retrieves all rows (*) from the table grades1 and orders them by the values in the id column, in ascending order.
for row in results:
    print(row)
print("-" * 60)

('John', 99)
('Kris', 95)
('Gary', 90)
('Cathy', 85)
('James', 80)
------------------------------------------------------------

In [10]:
results = db.execute("select name, score from grades1 order by score asc ") 
for row in results:
    print(row)
print("-" * 60)

('James', 80)
('Cathy', 85)
('Gary', 90)
('Kris', 95)
('John', 99)
------------------------------------------------------------